src/InformationRegisters/КлючиСтатей/КлючиСтатей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючиСтатей</name>
  <resources>
    <name>РодительскаяСтатья</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РодительскаяСтатьяВБюджете</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </resources>
  <resources>
    <name>ИсключатьИзБюджета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СправочникиУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КлючиСтатей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ключ статьи бюджета для указанного элемента справочника
//
//Параметры:
//	Ссылка - СправочникСсыллка - элемент, для которого нужно получить ключ
//	ТипСтатьи - Строка - Вид долга (для прочих справочнико не актуально)
//
//Возвращаемое значение:
//	Строка - ключ статьи
//
Функция КлючСтатьиБюджета(Ссылка, ТипСтатьи = Неопределено) Экспорт

	Набор = РегистрыСведений.КлючиСтатей.СоздатьНаборЗаписей();
	Набор.Отбор.СтатьяБюджета.Установить(Ссылка);
	Если ЗначениеЗаполнено(ТипСтатьи) Тогда
		Набор.Отбор.ТипСтатьи.Установить(ТипСтатьи);
	КонецЕсли;
	
	Набор.Прочитать();
	Если Не Набор.Выбран() Или Набор.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Набор[0].Ключ;

КонецФункции

// Возвращает массив с именами статей, которые могут использоваться в бюджете для справочника указанного типа
//
//Параметры:
//	ТипСправочника - тип
//
//Возвращаемое значение:
//	Массив - строки, названия статей.
//	Неопределено, если передан некорректный тип
//
Функция ТипыСтатейПоТипуСправочника(ТипСправочника) Экспорт

	ТипыСтатей  = Новый Массив;
	Если ТипСправочника = Тип("СправочникСсылка.КошелькиИСчета") Тогда
		ТипыСтатей.Добавить("Кошелек");
		ТипыСтатей.Добавить("КредитнаяКарта");
	ИначеЕсли ТипСправочника = Тип("СправочникСсылка.Долги") Тогда
		ТипыСтатей.Добавить("ДолгНам");
		ТипыСтатей.Добавить("НашДолг");
	ИначеЕсли ТипСправочника = Тип("СправочникСсылка.Контакты") Тогда
		ТипыСтатей.Добавить("Контакт");
	ИначеЕсли ТипСправочника = Тип("СправочникСсылка.СтатьиРасходов") Тогда
		ТипыСтатей.Добавить("СтатьяРасходов");
	ИначеЕсли ТипСправочника = Тип("СправочникСсылка.СтатьиДоходов") Тогда
		ТипыСтатей.Добавить("СтатьяДоходов");
	ИначеЕсли ТипСправочника = Тип("СправочникСсылка.Имущество") Тогда
		ТипыСтатей.Добавить("Имущество");
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	Возврат ТипыСтатей;

КонецФункции
 

#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти



#КонецЕсли
